#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>

```
terraform
Acquiring state lock. This may take a few moments...
openstack_networking_floatingip_v2.fip: Refreshing state... [id=1a2e1285-0a20-4582-aab9-27255607a862]
openstack_compute_secgroup_v2.secgroup: Refreshing state... [id=47779555-2ce1-400c-ba68-d177683c7228]
openstack_compute_instance_v2.dashboard: Refreshing state... [id=4880e835-6d5e-4233-a944-583820ec9a66]
openstack_compute_floatingip_associate_v2.fip: Refreshing state... [id=147.213.76.217/4880e835-6d5e-4233-a944-583820ec9a66/]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # openstack_compute_instance_v2.dashboard has been changed
  ~ resource "openstack_compute_instance_v2" "dashboard" {
        id                  = "4880e835-6d5e-4233-a944-583820ec9a66"
        name                = "dashboard"
      + tags                = []
        # (13 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }
  # openstack_networking_floatingip_v2.fip has been changed
  ~ resource "openstack_networking_floatingip_v2" "fip" {
      ~ fixed_ip  = "192.168.10.94" -> "192.168.10.83"
        id        = "1a2e1285-0a20-4582-aab9-27255607a862"
      ~ port_id   = "336adaaf-87d0-4cf4-8238-07094e6d95de" -> "cb83978a-d858-420b-9558-ce56c9df0b33"
        tags      = []
        # (4 unchanged attributes hidden)
    }

Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # openstack_compute_floatingip_associate_v2.fip must be replaced
-/+ resource "openstack_compute_floatingip_associate_v2" "fip" {
      ~ id          = "147.213.76.217/4880e835-6d5e-4233-a944-583820ec9a66/" -> (known after apply)
      ~ instance_id = "4880e835-6d5e-4233-a944-583820ec9a66" -> (known after apply) # forces replacement
      + region      = (known after apply)
        # (1 unchanged attribute hidden)
    }

  # openstack_compute_instance_v2.dashboard must be replaced
-/+ resource "openstack_compute_instance_v2" "dashboard" {
      ~ access_ip_v4        = "192.168.10.83" -> (known after apply)
      + access_ip_v6        = (known after apply)
      ~ all_metadata        = {} -> (known after apply)
      ~ all_tags            = [] -> (known after apply)
      ~ availability_zone   = "nova" -> (known after apply)
      ~ flavor_name         = "m1.medium" -> (known after apply)
      ~ id                  = "4880e835-6d5e-4233-a944-583820ec9a66" -> (known after apply)
      ~ image_name          = "Ubuntu-20.04-20211006" -> (known after apply)
        name                = "dashboard"
      + region              = (known after apply)
      - tags                = [] -> null
      ~ user_data           = "0cd3a7f1cd4bb10fb05f89399c90da5bf4b6d2ff" -> "e5783927810fa151d550730fea0e615020d781e4" # forces replacement
        # (6 unchanged attributes hidden)

      ~ network {
          ~ fixed_ip_v4    = "192.168.10.83" -> (known after apply)
          + fixed_ip_v6    = (known after apply)
          + floating_ip    = (known after apply)
          ~ mac            = "fa:16:3e:64:d9:43" -> (known after apply)
          ~ name           = "private-network" -> (known after apply)
          + port           = (known after apply)
            # (2 unchanged attributes hidden)
        }
    }

Plan: 2 to add, 0 to change, 2 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
Releasing state lock. This may take a few moments...

```

</details>

*Pusher: @enolfc, Action: `pull_request`*